docs/pgm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-02 Wed 15:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Probabilistic Graph Modelling</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jethro Kuan" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Probabilistic Graph Modelling</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfc05a04">1. Bayesian Networks</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgfc05a04" class="outline-2">
<h2 id="orgfc05a04"><span class="section-number-2">1</span> Bayesian Networks</h2>
<div class="outline-text-2" id="text-1">
<p>
A Bayesian network is a directed graph \(G = (V,E)\) together with a
random variable \(x_i\) for each node \(i \in V\), one conditional
probability distribution (CPD) p(x<sub>i</sub> | x<sub>A<sub>i</sub></sub>) per node, specifying
the probability of \(x_i\) conditioned on its parent's values.
</p>

<p>
We say that Q, W are <i>d-separated</i> when variables \(O\) are observed if
they are not connected by an <i>active path</i>. An undirected path in the
Bayesian network \(G\) is called <i>active</i> given observed variables \(O\)
if for every triple of variables \(X, Y, Z\) on the path, one of the
following holds:
</p>

<ul class="org-ul">
<li>\(X \leftarrow Y \leftarrow Z, Y \not\in O\)</li>
<li>\(X \rightarrow Y \rightarrow Z, Y \not\in O\)</li>
<li>\(X \leftarrow Y \rightarrow Z, Y \not\in O\)</li>
<li>\(X \rightarrow Y \leftarrow Z, Y \text{ or any descendents} \in O\)</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jethro Kuan</p>
<p class="date">Created: 2018-05-02 Wed 15:45</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
